## Plan Result (cft_ptl - TerraformPlanApply)




<pre><code>Plan: 49 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.monitoring_reader[&#34;CP-COPILOT-BETA&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;CRIME-ADO-POC&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DCD-AWS-Migration&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DCD-CFT-Sandbox&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DCD-CFT-VH-Pilot&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DCD-CFTAPPS-DEMO&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DCD-CFTAPPS-DEV&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DCD-CFTAPPS-ITHC&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DCD-CFTAPPS-PROD&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DCD-CFTAPPS-SBOX&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DCD-CFTAPPS-STG&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DCD-CFTAPPS-TEST&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DCD-CFTAPPSDATA-DEMO&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DCD-CNP-DEV&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DCD-CNP-Prod&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DCD-CNP-QA&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DCD-RDO-Development&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DCD-RDO-Production&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DCD-ROBOTICS-DEV&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DCD-ROBOTICS-SBOX&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-ARCHIVING-PROD&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-ARCHIVING-TEST&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-CFTPTL-INTSVC&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-CFTSBOX-INTSVC&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-DACS-SBOX&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-DATAINGEST-PROD&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-DATAINGEST-SBOX&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-DATAINGEST-STG&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-HERITAGE-EXTSVC-STG&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-HERITAGE-INTSVC-DEV&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-HERITAGE-INTSVC-PROD&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-HERITAGE-INTSVC-STG&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;HMCTS-CONTROL&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;HMCTS-HUB-PROD-INTSVC&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;HMCTS-HUB-SBOX-INTSVC&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;HMCTS-SOC-PROD&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;HMCTS-SOC-SBOX&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;MOJ DCD Atlassian LVE&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;MOJ DCD Atlassian NLE&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;MoJ Common Platform Non-Live Management&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;MoJ Common Platform Operational Services&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;MoJ Common Platform Production&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;Reform-CFT-Mgmt&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;Reform-CFT-VH-Dev&#34;]
* Update
  * azurerm_user_assigned_identity.this




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.monitoring_reader["CP-COPILOT-BETA"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "476d6e89-33bd-468d-a9e6-749f4a4aa7a1"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["CRIME-ADO-POC"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "deb6a299-036c-4dd9-acb0-4cc63723e118"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DCD-AWS-Migration"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f4c47bf2-662c-40fc-838e-afc49f206773"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DCD-CFT-Sandbox"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d14f75f0-be54-403c-a1e1-7172637a3ae1"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DCD-CFT-VH-Pilot"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "063526e9-da78-4d26-92d5-ce34293769c0"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DCD-CFTAPPS-DEMO"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c4a5cd0b-a6a9-43a0-89da-8c48afd02a00"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DCD-CFTAPPS-DEV"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ef97b2f2-69c1-4692-8424-40f973d9d227"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DCD-CFTAPPS-ITHC"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "9dbbc315-77fa-4ada-846f-bb9c2fc26e93"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DCD-CFTAPPS-PROD"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "5560d892-9d16-43d8-8d76-c0d6a70fb39a"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DCD-CFTAPPS-SBOX"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f87ef2b4-59fc-4235-942e-4e79723792e4"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DCD-CFTAPPS-STG"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a0d905a0-ac7b-4979-af64-a8e4a88c147b"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DCD-CFTAPPS-TEST"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "13fe53ef-8573-42c4-b63a-58d87bf8441e"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DCD-CFTAPPSDATA-DEMO"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "88747538-17db-4d7f-9499-b086239989a1"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DCD-CNP-DEV"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "10a0b1dc-9b4f-4d56-8593-8da02f5d3e5d"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DCD-CNP-Prod"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b8002adf-b0cd-4264-82fc-82ddc71a256d"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DCD-CNP-QA"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "26b68fef-31eb-44cd-a844-c9ef595fe685"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DCD-RDO-Development"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "254e2a1e-dab8-4f57-9524-700c4611bbef"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DCD-RDO-Production"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "242ba2d6-e420-4e50-87b6-88447588b23d"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DCD-ROBOTICS-DEV"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "9b651012-bb82-4339-a83c-e8f1cd5f45f5"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DCD-ROBOTICS-SBOX"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "eef99f49-b78f-4515-b6cc-1561fdba0995"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-ARCHIVING-PROD"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "68549602-2dd5-4230-bf3b-8d35a11164d5"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-ARCHIVING-TEST"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "10a46d0d-f32a-4252-9c52-65e3a829002a"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-CFTPTL-INTSVC"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6c753598-9c11-4faf-ae7c-ab877b4a7661"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-CFTSBOX-INTSVC"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "29aed470-ba33-4139-a57a-0cec73053242"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-DACS-SBOX"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "cb44730e-1b05-406d-aafc-4f811c84a5a3"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-DATAINGEST-PROD"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7535c484-0b55-4e23-b69b-fb978eb5546b"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-DATAINGEST-SBOX"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a5004ca6-a6f7-41f2-a1ce-97eec2b315ac"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-DATAINGEST-STG"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3c58a61f-b289-41f9-acd7-9a249671c225"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-HERITAGE-EXTSVC-PROD"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "5f29910d-50d4-424b-a888-e95c59dc9d70"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-HERITAGE-EXTSVC-STG"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "99a249b4-2447-43a1-ac6e-87a1887d9796"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-HERITAGE-INTSVC-DEV"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "78a4c112-61d9-4f7d-afc0-00e7721e34d4"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-HERITAGE-INTSVC-PROD"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "eb8a4f87-b313-4603-9879-cac03d49528d"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-HERITAGE-INTSVC-STG"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "4691d667-6c21-4638-95b1-080a44226ae3"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-MANAGEMENT-NONPROD-INTSVC"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6dea1d64-36a5-487c-92a9-44248c555bfc"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-MANAGEMENT-PROD-INTSVC"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "1aeccfdc-0cad-44c9-9414-642520a8b1e9"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-MANAGEMENT-SBOX-INTSVC"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "05ccd928-59e9-428d-b478-ff5af2ccbe1c"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["HMCTS-CONTROL"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "066f3802-6102-40eb-8576-25fc5ac00294"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["HMCTS-HUB-NONPROD-INTSVC"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "9a2d990e-ce3c-42f8-80de-0a15425a89e2"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["HMCTS-HUB-PROD-INTSVC"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e7c3b460-22de-41fd-92d3-0865c889060c"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["HMCTS-HUB-SBOX-INTSVC"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8757c2dc-39fc-4a31-a101-83554929fd96"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["HMCTS-SOC-PROD"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "969dd7f3-22de-4bb7-878a-ed76f4a1f27b"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["HMCTS-SOC-SBOX"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c2ed50eb-7f89-4c36-be94-f38c4f1e4a30"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["MOJ DCD Atlassian LVE"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "12784a53-6921-49b4-b423-226359eac604"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["MOJ DCD Atlassian NLE"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "689d247b-3558-4c62-ac72-a834bd3208a5"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["MoJ Common Platform Non-Live Management"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "215927f5-a61b-4721-b03d-5291b009544a"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["MoJ Common Platform Operational Services"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "97983fff-b312-4973-b0b6-748d705db678"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["MoJ Common Platform Production"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "41e782ba-d46d-46df-90ec-6987ec0f4923"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["Reform-CFT-Mgmt"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7285fd5f-bd67-49d7-82d8-9d28815a9754"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["Reform-CFT-VH-Dev"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c17e7151-6d52-4cda-8110-fa3a954306bb"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_user_assigned_identity.this will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "this" {
        id                  = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.ManagedIdentity/userAssignedIdentities/cft-alerts-slack-ptl"
        name                = "cft-alerts-slack-ptl"
      ~ tags                = {
          - "application"  = "core" -> null
          - "builtFrom"    = "hmcts/azure-alert-to-slack-function" -> null
          - "businessArea" = "CFT" -> null
          - "environment"  = "production" -> null
        }
        # (5 unchanged attributes hidden)
    }

Plan: 49 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":9,"Program":"tfcmt","SHA1":"","Target":"cft_ptl - TerraformPlanApply","Vars":{}} -->